## OYO Business Analyst Interview Questions:
### Python Questions
1. Write a Python function to calculate the revenue generated per city from a dataset of hotel bookings stored in a CSV file. Each row contains columns: city, room_price, and number_of_nights.
2. Write a Python program to find the city with the highest growth in bookings month-over-month using a dataset with columns: city, booking_date, and number_of_bookings.
3. Create a Python script to calculate the percentage of cancellations for each property from a dataset containing columns: property_id, booking_status (confirmed/cancelled).
4. Write a Python function to identify properties with unusually high cancellation rates using the Z-score method on the cancellation percentage.
5. Write a Python program to plot a bar chart showing the top 5 cities by total revenue using Matplotlib or Seaborn.

In [1]:
import pandas as pd
import numpy as np

In [3]:
#Import dataset
hotelbooking = pd.read_csv('./Dataset/hotel_bookings.csv')
bookinggrowth = pd.read_csv('./Dataset/booking_growth.csv')
cancellations = pd.read_csv('./Dataset/cancellations.csv')

In [4]:
#Solving question1
hotelbooking.head()

      city  room_price  number_of_nights
0  Houston         147                 3
1    Miami         247                 7
2  Chicago         444                 2
3    Miami         289                 2
4    Miami         193                 7

In [6]:
hotelbooking['total_cost'] = hotelbooking['room_price'] * hotelbooking['number_of_nights']
hotelbooking.head()

      city  room_price  number_of_nights  total_cost
0  Houston         147                 3         441
1    Miami         247                 7        1729
2  Chicago         444                 2         888
3    Miami         289                 2         578
4    Miami         193                 7        1351

In [9]:
result = hotelbooking.groupby('city')['total_cost'].sum().reset_index()
print(result)

          city  total_cost
0      Chicago       51467
1      Houston       62625
2  Los Angeles       43513
3        Miami       53663
4     New York       56076

In [10]:
#Solving Question2
bookinggrowth.head()

          city booking_date  number_of_bookings
0     New York   2024-02-24                  17
1        Miami   2024-12-24                  44
2  Los Angeles   2024-05-10                  28
3      Houston   2024-10-14                  29
4        Miami   2024-09-22                  21

In [13]:
bookinggrowth['booking_date'] = pd.to_datetime(bookinggrowth['booking_date'])
bookinggrowth.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   city                500 non-null    object
 1   booking_date        500 non-null    datetime64[ns]
 2   number_of_bookings  500 non-null    int64
 3   year_month          500 non-null    period[M]
dtypes: datetime64[ns](1), int64(1), object(1), period[M](1)
memory usage: 15.8+ KB

In [15]:
bookinggrowth['year_month'] = bookinggrowth['booking_date'].dt.to_period("M")
bookinggrowth.head()

          city booking_date  number_of_bookings year_month
0     New York   2024-02-24                  17    2024-02
1        Miami   2024-12-24                  44    2024-12
2  Los Angeles   2024-05-10                  28    2024-05
3      Houston   2024-10-14                  29    2024-10
4        Miami   2024-09-22                  21    2024-09

In [16]:
#aggregate over month-year
monthly = bookinggrowth.groupby(['city','year_month']).sum().reset_index()

In [17]:
monthly = monthly.sort_values(['city','year_month'])